Enums/ОДМ_СтатусыЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ОДМ_СтатусыЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершён</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подготовлен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ОДМ_СтатусыЗадач/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция АктивныеСтатусы() Экспорт
	
	РезультатМетода = Новый Массив;
	
	РезультатМетода.Добавить(Перечисления.ОДМ_СтатусыЗадач.Выполняется);
	РезультатМетода.Добавить(Перечисления.ОДМ_СтатусыЗадач.Подготовлен);
	
	Возврат РезультатМетода;
	
КонецФункции

Функция ЗавершенныеСтатусы() Экспорт
	
	РезультатМетода = Новый Массив;
	
	РезультатМетода.Добавить(Перечисления.ОДМ_СтатусыЗадач.Выполнен);
	РезультатМетода.Добавить(Перечисления.ОДМ_СтатусыЗадач.Завершён);
	РезультатМетода.Добавить(Перечисления.ОДМ_СтатусыЗадач.Отменен);
	РезультатМетода.Добавить(Перечисления.ОДМ_СтатусыЗадач.Ошибка);
	
	Возврат РезультатМетода;
	
КонецФункции

Функция ЭтоАктивныйСтатус(Знач Статус) Экспорт
	
	Статусы = АктивныеСтатусы();
	Найден = НЕ (Статусы.Найти(Статус) = Неопределено);
	
	Возврат Найден;
	
КонецФункции

Функция ЭтоЗавершенныйСтатус(Знач Статус) Экспорт
	
	Статусы = ЗавершенныеСтатусы();
	Найден = НЕ (Статусы.Найти(Статус) = Неопределено);
	
	Возврат Найден;
	
КонецФункции


#КонецОбласти // ПрограммныйИнтерфейс

#КонецЕсли
